Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "#" can be customized with core.commentChar.
zh_cn: "#" 可以通过 core.commentChar 自定义。

source: "**/foo/bar" matches file or directory "bar" anywhere that is directly under directory "foo".
zh_cn: "**/foo/bar" 匹配任何位置的，直接位于目录 "foo" 下的文件或目录 "bar" 。

source: "Secure Hash Algorithm 1"; a cryptographic hash function.
zh_cn: "安全散列算法1";加密哈希函数。

source: "git diff A...B" is equivalent to "git diff $(git-merge-base A B) B".
zh_cn: "git diff A...B" 等价于 "git diff $(git-merge-base A B) B".

source: "ignore" by default.
zh_cn: 默认为"ignore"。

source: (It does not affect the working tree or the current branch.)
zh_cn: (它不影响工作树或当前分支。)

source: (See git-config[1]).
zh_cn: (参见 git-config[1] )。

source: (See git-pack-refs[1].)
zh_cn: (参见 git-pack-refs[1] 。)

source: (See the "RECOVERING FROM UPSTREAM REBASE" section in git-rebase[1].)
zh_cn: (见 git-rebase[1] 中的"从 UPSTREAM REBASE 恢复"部分。)

source: (See the "RECOVERING FROM UPSTREAM REBASE" section in git-rebase[1] for the implications of doing so.)
zh_cn: （参见 git-rebase[1] 中的"从 UPSTREAM REBASE 恢复"部分的含义。

source: (There is no option to remove a file only from the working tree and yet keep it in the index; use /bin/rm if you want to do that.) The files being removed have to be identical to the tip of the branch, and no updates to their contents can be staged in the index, though that default behavior can be overridden with the -f option.
zh_cn: (没有选项能只从工作树中删除文件，并将其保留在索引中;如果要这样做，请使用 /bin/rm 。)要删除的文件必须与分支尖端相同，并且在索引中不能对其内容进行暂存，尽管可以使用 -f 选项覆盖默认行为。

source: - print help
zh_cn: - 输出帮助

source: --staged is a synonym of --cached.
zh_cn: --staged 是--cached 的同义词。

source: 2.1.1 → 2.10.5 no changes
zh_cn: 2.1.1 → 2.10.5 无更改

source: 2.1.1 → 2.3.10 no changes
zh_cn: 2.1.1 → 2.3.10 无更改

source: 2.1.1 → 2.9.0 no changes
zh_cn: 2.1.1 → 2.9.0 无更改

source: 2.10.2 → 2.13.6 no changes
zh_cn: 2.10.2 → 2.13.6 无更改

source: 2.10.4 → 2.10.5 no changes
zh_cn: 2.10.4 → 2.10.5 无更改

source: 2.11.1 → 2.12.5 no changes
zh_cn: 2.11.1 → 2.12.5 无更改

source: 2.11.1 → 2.14.2 no changes
zh_cn: 2.11.1 → 2.14.2 无更改

source: 2.11.3 → 2.11.4 no changes
zh_cn: 2.11.3 → 2.11.4 无更改

source: 2.12.1 → 2.14.2 no changes
zh_cn: 2.12.1 → 2.14.2 无更改

source: 2.12.4 → 2.12.5 no changes
zh_cn: 2.12.4 → 2.12.5 无更改

source: 2.13.1 → 2.13.6 no changes
zh_cn: 2.13.1 → 2.13.6 无更改

source: 2.13.2 → 2.14.1 no changes
zh_cn: 2.13.2 → 2.14.1 无更改

source: 2.13.3 → 2.13.6 no changes
zh_cn: 2.13.3 → 2.13.6 无更改

source: 2.14.1 → 2.14.2 no changes
zh_cn: 2.14.1 → 2.14.2 无更改

source: 2.2.1 → 2.3.10 no changes
zh_cn: 2.2.1 → 2.3.10 无更改

source: 2.3.1 → 2.3.10 no changes
zh_cn: 2.3.1 → 2.3.10 无更改

source: 2.3.1 → 2.6.7 no changes
zh_cn: 2.3.1 → 2.6.7 无更改

source: 2.4.1 → 2.4.2 no changes
zh_cn: 2.4.1 → 2.4.2 无更改

source: 2.4.1 → 2.5.6 no changes
zh_cn: 2.4.1 → 2.5.6 无更改

source: 2.4.1 → 2.8.6 no changes
zh_cn: 2.4.1 → 2.8.6 无更改

source: 2.4.4 → 2.7.0 no changes
zh_cn: 2.4.4 → 2.7.0 无更改

source: 2.6.1 → 2.7.6 no changes
zh_cn: 2.6.1 → 2.7.6 无更改

source: 2.7.2 → 2.10.0 no changes
zh_cn: 2.7.2 → 2.10.0 无更改

source: 2.7.2 → 2.7.6 no changes
zh_cn: 2.7.2 → 2.7.6 无更改

source: 2.7.6 no changes
zh_cn: 2.7.6 无更改

source: 2.8.1 no changes
zh_cn: 2.8.1 无更改

source: 2.8.1 → 2.8.6 no changes
zh_cn: 2.8.1 → 2.8.6 无更改

source: 2.8.4 → 2.9.0 no changes
zh_cn: 2.8.4 → 2.9.0 无更改

source: 2.8.6 no changes
zh_cn: 2.8.6 无更改

source: 2.9.2 no changes
zh_cn: 2.9.2 无更改

source: 2.9.2 → 2.10.5 no changes
zh_cn: 2.9.2 → 2.10.5 无更改

source: 2.9.2 → 2.11.4 no changes
zh_cn: 2.9.2 → 2.11.4 无更改

source: 2.9.4 → 2.14.2 no changes
zh_cn: 2.9.4 → 2.14.2 无更改

source: 2.9.5 no changes
zh_cn: 2.9.5 无更改

source: 2.9.5 → 2.14.1 no changes
zh_cn: 2.9.5 → 2.14.1 无更改

source: Individual Developer (Standalone) commands are essential for anybody who makes a commit, even for somebody who works alone.
zh_cn: 个人开发人员（独立） 命令对于任何作提交的人，即使是单独工作的人也是至关重要的。

source: Repositories and Branches and Exploring Git history explain how to fetch and study a project using git—​read these chapters to learn how to build and test a particular version of a software project, search for regressions, and so on.
zh_cn: 仓库和分支 和 探索 Git 历史 解释如何使用 git 来获取和学习一个项目，阅读这些章节以了解如何构建和测试软件项目的特定版本，搜索回归等等。

source: Repository Administration commands are for system administrators who are responsible for the care and feeding of Git repositories.
zh_cn: 仓库管理 命令用于负责 Git 仓库的 care 和 feeding 的系统管理员。

source: Version 2.14.2 ▾ git last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-add last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-add 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-clone last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-clone 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-config last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-config 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-help last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-help 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-init last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-init 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-mergetool last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-mergetool 最后更新于 2.14.2

source: Version 2.14.2 ▾ git-rm last updated in 2.14.2
zh_cn: Version 2.14.2 ▾ git-rm 最后更新于 2.14.2

source: git-add[1] to manage the index file.
zh_cn: git-add[1] 来管理索引文件。

source: git-am[1] to apply patches e-mailed in from your contributors.
zh_cn: git-am[1] 应用您的贡献者发送的补丁。

source: git-checkout[1] and git-branch[1] to switch branches.
zh_cn: git-checkout[1] 和 git-branch[1] 切换分支。

source: git-clone[1] from the upstream to prime your local repository.
zh_cn: git-clone[1] 从上游填充您的本地存储库。

source: git-commit[1] to advance the current branch.
zh_cn: git-commit[1] 推进当前分支。

source: git-diff[1] and git-status[1] to see what you are in the middle of doing.
zh_cn: git-diff[1] 和 git-status[1] ，看看你在做什么。

source: git-format-patch[1] to prepare and send suggested alternative to contributors.
zh_cn: git-format-patch[1] 准备并发送建议替代给贡献者。

source: git-format-patch[1] to prepare e-mail submission, if you adopt Linux kernel-style public forum workflow.
zh_cn: 如果采用 Linux 内核风格的公共论坛工作流程，则需要 git-format-patch[1] 来准备电子邮件提交。

source: git-init[1] to create a new repository.
zh_cn: git-init[1] 来创建一个新的存储库。

source: git-log[1] to see what happened.
zh_cn: git-log[1] 看看发生了什么。

source: git-merge[1] to merge between local branches.
zh_cn: git-merge[1] 在本地分支之间合并。

source: git-pull[1] and git-fetch[1] from "origin" to keep up-to-date with the upstream.
zh_cn: 从 "origin" 的 git-pull[1] 和 git-fetch[1] 保持最新的上游。

source: git-pull[1] to merge from your trusted lieutenants.
zh_cn: git-pull[1] 从你信任的副官合并。

source: git-push[1] to publish the bleeding edge.
zh_cn: git-push[1] 发布 bleeding edge.

source: git-push[1] to shared repository, if you adopt CVS style shared repository workflow.
zh_cn: 如果采用 CVS 样式共享仓库工作流， git-push[1] 共享仓库。

source: git-rebase[1] to maintain topic branches.
zh_cn: git-rebase[1] 维护主题分支。

source: git-request-pull[1] to create a summary of changes for your upstream to pull.
zh_cn: git-request-pull[1] 来创建您上游要拉取的更改的摘要。

source: git-reset[1] and git-checkout[1] (with pathname parameters) to undo changes.
zh_cn: git-reset[1] 和 git-checkout[1] (使用路径名参数)撤消更改。

source: git-revert[1] to undo botched commits.
zh_cn: git-revert[1] 来撤销拙劣的提交。

source: git-send-email[1] to send your e-mail submission without corruption by your MUA.
zh_cn: git-send-email[1] 发送您的电子邮件提交而不会被您的 MUA 篡改。

source: git-tag[1] to mark a known point.
zh_cn: git-tag[1] 标记一个已知点。

source: gitcli[7] manual page gives you an overview of the command-line command syntax.
zh_cn: gitcli[7] 手册页给你提供了一个概述的命令行语法。

source: http://www.openhub.net/p/git/contributors/summary gives you a more complete list of contributors.
zh_cn: http://www.openhub.net/p/git/contributors/summary 给你一个更完整的贡献者列表。

source: $GIT_SSH_COMMAND takes precedence over $GIT_SSH, and is interpreted by the shell, which allows additional arguments to be included.
zh_cn: $GIT_SSH_COMMAND 优先于 $GIT_SSH, 并且由 shell 解析，允许包括额外的参数。

source: --contains <commit> is used to find all branches which will need special attention if <commit> were to be rebased or amended, since those branches contain the specified <commit>.
zh_cn: --contains <commit> 用于查找所有需要特别注意的分支，如果<commit>被重新修改或修改，因为这些分支包含指定的<commit>。

source: --merged is used to find all branches which can be safely deleted, since those branches are fully contained by HEAD.
zh_cn: --merged 用于查找可以安全删除的所有分支，因为这些分支是由 HEAD 完全包含的。

source: --no-contains <commit> is the inverse of that, i.e. branches that don’t contain the specified <commit>.
zh_cn: --no-contains <commit> 是相反的，即不包含指定的<commit>的分支。

source: --no-merged is used to find branches which are candidates for merging into HEAD, since those branches are not fully contained by HEAD.
zh_cn: --no-merged 用于查找候选的合并到 HEAD 中的分支，因为这些分支未被 HEAD 完全包含。

source: git mergetool creates *.orig backup files while resolving merges.
zh_cn: 在解决合并时， git mergetool 创建 *.orig 备份文件。

source: git pull fetches from origin by default and merges into the current branch.
zh_cn: git pull 默认从 origin 提取，并合并到当前分支中。

source: git rm normally outputs one line (in the form of an rm command) for each file removed.
zh_cn: git rm 通常为删除的每个文件输出一行(以 rm 命令的形式)。

source: git rm will not remove a file from just your working directory.
zh_cn: git rm 不会从您的工作目录中移除文件。

source: --branch can also take tags and detaches the HEAD at that commit in the resulting repository.
zh_cn: --branch 也可以在生成的存储库中的标签和分离 HEAD。

source: $GIT_SSH on the other hand must be just the path to a program (which can be a wrapper shell script, if additional arguments are needed).
zh_cn: 另一方面，$GIT_SSH 只能是程序的地址（如果需要额外的参数，则可以是一个 shell 的包装脚本）。

source: <time zone offset> is a positive or negative offset from UTC.
zh_cn: <time zone offset> 是与 UTC 的正或负偏移量。

source: git reflog show is an alias for git log -g --abbrev-commit --pretty=oneline; see git-log[1] for more information.
zh_cn: git reflog show 是 git log -g --abbrev-commit --pretty=oneline 的一个别名; 详见 git-log[1] 。

source: stdout-is-tty should be either "true" or "false", and is taken into account when configuration says "auto".
zh_cn: stdout-is-tty 应为“true”或“false”，并在配置为“auto”时考虑。

source: GIT_EXTERNAL_DIFF should not worry about unlinking the temporary file --- it is removed when GIT_EXTERNAL_DIFF exits.
zh_cn: GIT_EXTERNAL_DIFF 不应担心取消临时文件的链接---当 GIT_EXTERNAL_DIFF 退出时，它将被移除。

source: @ alone is a shortcut for HEAD.
zh_cn: 单独的 @ 是 HEAD 的快捷方式。

source: all - Also shows individual files in untracked directories.
zh_cn: all - 还显示未跟踪目录中的各个文件。

source: git checkout with <paths> or --patch is used to restore modified or deleted paths to their original contents from the index or replace paths with the contents from a named <tree-ish> (most often a commit-ish).
zh_cn: git checkout 带 <paths> 或 --patch 用于从索引中的将修改或删除的文件恢复到其原始内容，或者使用指定的<tree-ish>(最常见的是 commit-ish)替换文件内容。

source: git config will ensure that the output is "true" or "false"
zh_cn: git config 将确保输出为“true”或“false”

source: git config will ensure that the output is a simple decimal number.
zh_cn: git config 将确保输出是一个简单的十进制数。

source: git config will ensure that the output matches the format of either --bool or --int, as described above.
zh_cn: git config 将确保输出与 --bool 或 --int 的格式匹配，如上所述。

source: git fetch can fetch from either a single named repository or URL, or from several repositories at once if <group> is given and there is a remotes.<group> entry in the configuration file.
zh_cn: git fetch 可以从单个命名的仓库或 URL 中抓取，也可以从多个仓库中抓取，如果给出了<group>，并且配置文件中有一个 remotes.<group> 条目。

source: git merge-base finds best common ancestor(s) between two commits to use in a three-way merge.
zh_cn: git merge-base 在两个提交之间找到最佳的共同祖先，以便在三向合并中使用。

source: git svn is a simple conduit for changesets between Subversion and Git.
zh_cn: git svn 是用于 Subversion 和 Git 之间的更改的简单管道。

source: git-config will expand leading ~ to the value of $HOME, and ~user to the home directory for the specified user.
zh_cn: git-config 将 ~ 开头扩展为 $HOME ，将 ~user 的值扩展到指定用户的主目录。

source: no - Show no untracked files
zh_cn: no - 不显示未追溯的文件

source: normal - Shows untracked files and directories
zh_cn: normal - 显示未跟踪的文件和目录

source: ^<n> means the <n>th parent (i.e. <rev>^ is equivalent to <rev>^1).
zh_cn: ^<n> 表示第 n 个父对象(即 <rev>^ 等同于 <rev>^1 )。

source: git merge --abort will abort the merge process and try to reconstruct the pre-merge state.
zh_cn: git merge --abort 将中止合并进程，并尝试重构合并前状态。

source: <num> specifies how many lines from the annotation, if any, are printed when using -l.
zh_cn: <num>指定在使用-l 时打印多少条注释（如果有）。

source: <refspec> can name an arbitrary remote ref (for example, the name of a tag) or even a collection of refs with corresponding remote-tracking branches (e.g., refs/heads/*:refs/remotes/origin/*), but usually it is the name of a branch in the remote repository.
zh_cn: <refspec>可以指定任意的远程引用(例如，标签的名称)，甚至可以使用相应的远程跟踪分支的引用集合(例如，refs/heads/*:refs/remotes/origin/*)，但是通常它是远程存储库中的分支的名称。

source: <repository> should be the name of a remote repository as passed to git-fetch[1].
zh_cn: <repository>应该是传递给 git-fetch[1] 的远程仓库的名称。

source: Check your version of git by running
zh_cn: 通过运行检查您的 git 版本

source: NOTE: The latter form is just a short-hand of git checkout topic followed by git rebase master.
zh_cn: NOTE: 后一种形式只是 git checkout topic ，后跟 git rebase master 的快捷方式。

source: NOTE: see the NOTE for the --shared option, and also the --dissociate option.
zh_cn: 注意 ：请参阅 --shared 选项的注释，以及 --dissociate 选项。

source: Warning: Running git merge with non-trivial uncommitted changes is discouraged: while possible, it may leave you in a state that is hard to back out of in the case of a conflict.
zh_cn: 警告 ：带有非琐碎的未提交的更改，运行 git merge 是不鼓励的：它可能会使您因冲突处于难以返回的状态。

source: git config will only ever change one file at a time.
zh_cn: git config 一次只会更改一个文件。

source: A 1-based counter incremented by one for every path.
zh_cn: 一个基于1的计数器为每个路径增加一个计数器。

source: A commit object or an object that can be recursively dereferenced to a commit object.
zh_cn: 一个commit object 或 object ，可以递归地取消引用（译注：不应该是引用到么）到提交对象。

source: A named reference to the commit at the tip of a branch.
zh_cn: branch 尖端的 commit 的 named reference 。

source: A working tree is clean, if it corresponds to the revision referenced by the current head.
zh_cn: 如果当前 head 对应于引用的 revision ，则 working tree 是干净的。

source: A working tree is said to be "dirty" if it contains modifications which have not been committed to the current branch.
zh_cn: 如果 working tree 包含尚未进行 committed 到当前 branch 的更改，则称为 "dirty"。

source: A gitattributes file is a simple text file that gives attributes to pathnames.
zh_cn: 一个 gitattributes 文件是将 attributes 赋予路径名的简单文本文件。

source: A gitignore file specifies intentionally untracked files that Git should ignore.
zh_cn: 一个 gitignore 文件指定了 Git 应该有意忽略的未跟踪文件。

source: A CVS server emulator for Git
zh_cn: 用于 Git 的 CVS 服务器仿真器

source: A Git project normally consists of a working directory with a ".git" subdirectory at the top level.
zh_cn: Git 项目通常由顶层的".git"子目录的工作目录组成。

source: A GnuPG signed tag object will be created when -s or -u <keyid> is used.
zh_cn: 当使用 -s 或 -u <keyid> 时，将创建一个 GnuPG 签名的标签对象。

source: A birds-eye view of Git’s source code
zh_cn: Git 源代码的鸟瞰图

source: A blank line matches no files, so it can serve as a separator for readability.
zh_cn: 空白行不匹配任何文件，因此它可以作为可读性的分隔符。

source: A command that takes a <commit-ish> argument ultimately wants to operate on a <commit> object but automatically dereferences <tag> objects that point at a <commit>.
zh_cn: 使用<commit-ish>参数的命令最终需要在<commit>对象上操作，但会自动解析指向<commit>的<tag>对象。

source: A command that takes a <tree-ish> argument ultimately wants to operate on a <tree> object but automatically dereferences <commit> and <tag> objects that point at a <tree>.
zh_cn: 使用<tree-ish>参数的命令最终需要在<tree>对象上操作，但是会自动解析指向<tree>的<commit>和<tag>对象。

source: A developer working as a participant in a group project needs to learn how to communicate with others, and uses these commands in addition to the ones needed by a standalone developer.
zh_cn: 作为组织项目参与者的开发人员需要了解如何与他人进行沟通，并且除了独立开发人员所需的命令外，还使用这些命令。

source: A dumb server that does not do on-the-fly pack generations must have some auxiliary information files in $GIT_DIR/info and $GIT_OBJECT_DIRECTORY/info directories to help clients discover what references and packs the server has.
zh_cn: 一个不做即时封装代码的哑服务器必须在 $GIT_DIR/info 和 $GIT_OBJECT_DIRECTORY/info 目录中有一些辅助信息文件，以帮助客户端发现服务器具有哪些引用和包。

source: A fairly central person acting as the integrator in a group project receives changes made by others, reviews and integrates them and publishes the result for others to use, using these commands in addition to the ones needed by participants.
zh_cn: 在集体项目中作为集成者的相当重要的人员接到他人做出的改变，对其进行评估和整合，并将结果发布给其他人使用，除了参与者需要的命令之外还使用这些命令。

source: A file can be reverted back, only in the index but not in the working tree, to that of the last commit with git reset HEAD -- <file>, which effectively reverts git add and prevents the changes to this file from participating in the next commit.
zh_cn: 一个文件只能在索引中被还原，而不是在工作树中，使用 git reset HEAD -- <file> 还原为上一次提交，这有效地恢复了git add，并阻止对此文件的更改参与下一次提交。

source: A formatted and hyperlinked copy of the latest Git documentation can be viewed at https://git.github.io/htmldocs/git.html.
zh_cn: 可以在 https://git.github.io/htmldocs/git.html 查看最新 Git 文档的格式化和超链接副本。

source: A fourth object type, the tag, is provided for this purpose.
zh_cn: 为此目的提供了第四个对象类型，tag（标签）。

source: A handy way to push the current branch to the same name on the remote.
zh_cn: 将当前分支推送到远程上相同名称的方便方法。

source: A leading "**" followed by a slash means match in all directories.
zh_cn: 开头的 "**" 后跟斜杠表示在所有目录中匹配。

source: A leading directory name (e.g. dir to remove dir/file1 and dir/file2) can be given to remove all files in the directory, and recursively all sub-directories, but this requires the -r option to be explicitly given.
zh_cn: 可以提供目录名称(例如 dir 删除 dir/file1 和 dir/file2 )，以删除目录中的所有文件，也可以递归所有子目录，但这需要明确给出 -r 选项。

source: A leading slash matches the beginning of the pathname.
zh_cn: 开头的斜杠与路径名的开头匹配。

source: A line starting with # serves as a comment.
zh_cn: 以 # 开头的行作为注释。

source: A name referring to a list of repositories as the value of remotes.<group> in the configuration file.
zh_cn: 在配置文件中通过 remotes.<group> 的值配置的，一组仓库的引用。

source: A number controlling the amount of output shown by the recursive merge strategy.
zh_cn: 一个数字，用于控制递归合并策略显示的输出量。

source: A pathspec that begins with a colon : has special meaning.
zh_cn: 以冒号 : 开头的 pathspec 有特殊的含义。

source: A pathspec with only a colon means "there is no pathspec".
zh_cn: 一个只有一个冒号的 pathspec 意味着 "没有 pathspec"。

source: A portable graphical interface to Git
zh_cn: Git 的便携式图形界面

source: A project normally includes such .gitignore files in its repository, containing patterns for files generated as part of the project build.
zh_cn: 项目通常在其存储库中包含这样的 .gitignore 文件，其中包含作为项目构建一部分生成的文件的模式。

source: A range of commits could also be removed with rebase.
zh_cn: 一系列提交也可以用 rebase 删除。

source: A really simple TCP Git daemon that normally listens on port "DEFAULT_GIT_PORT" aka 9418.
zh_cn: 一个非常简单的 TCP Git 守护程序，通常监听端口 "DEFAULT_GIT_PORT" 即 9418。

source: A really simple server for Git repositories
zh_cn: 一个非常简单的 Git 仓库服务器

source: A ref followed by the suffix @ with a date specification enclosed in a brace pair (e.g. {yesterday}, {1 month 2 weeks 3 days 1 hour 1 second ago} or {1979-02-26 18:30:00}) specifies the value of the ref at a prior point in time.
zh_cn: 引用后跟 @ 及用括号括起来的日期格式 (如 {yesterday}, {1 month 2 weeks 3 days 1 hour 1 second ago} or {1979-02-26 18:30:00}) 指定在先前时间点的引用值。

source: A ref followed by the suffix @ with an ordinal specification enclosed in a brace pair (e.g. {1}, {15}) specifies the n-th prior value of that ref.
zh_cn: 引用后跟 @ 及包含在大括号中的序号(例如 {1} ， {15} )，指定该引用的前 n 值。

source: A ref may contain the SHA-1 name of an object or the name of another ref.
zh_cn: 一个引用可以包含对象的 SHA-1 名称或另一个引用的名称。

source: A reflog shows the local "history" of a ref.
zh_cn: reflog 显示一个引用的本地 "历史"。

source: A repository administrator uses the following tools to set up and maintain access to the repository by developers.
zh_cn: 仓库管理员使用以下工具来设置和维护开发人员对仓库的访问。

source: A revision parameter <rev> typically, but not necessarily, names a commit object.
zh_cn: 修订参数 <rev> 通常但不一定指定一个提交对象。

source: A sample output looks like this:
zh_cn: 示例输出如下所示：

source: A scripted Porcelain command can use set_reflog_action helper function in git-sh-setup to set its name to this variable when it is invoked as the top level command by the end user, to be recorded in the body of the reflog.
zh_cn: 脚本化的高级命令可以在 git-sh-setup 中使用 set_reflog_action 帮助器函数将其名称设置为该变量，作为最终用户作为顶层命令调用，将其记录在 reflog 内。

source: A simple script to set up gitweb and a web server for browsing the local repository.
zh_cn: 用于设置 gitweb 的简单脚本和用于浏览本地存储库的 Web 服务器。

source: A slash followed by two consecutive asterisks then a slash matches zero or more directories.
zh_cn: 一个斜杠后跟两个连续的星号，然后一个斜杠匹配零个或多个目录。

source: A special ref named HEAD contains the name of the currently checked-out branch.
zh_cn: 名为 HEAD 的特殊引用包含当前签出的分支的名称。

source: A standalone individual developer does not exchange patches with other people, and works alone in a single repository, using the following commands.
zh_cn: 独立的个人开发人员不会与其他人交换补丁，并且在单个仓库中单独工作，使用以下命令

source: A stash is by default listed as "WIP on branchname …​", but you can give a more descriptive message on the command line when you create one.
zh_cn: 默认情况下，储藏保存列表为"WIP on branchname …​"，但是您可以在创建时在命令行上给出更详细的描述性消息。

source: A suffix ^ to a revision parameter means the first parent of that commit object.
zh_cn: 修订参数的后缀 ^ 表示该提交对象的第一个父对象。

source: A suffix ~<n> to a revision parameter means the commit object that is the <n>th generation ancestor of the named commit object, following only the first parents.
zh_cn: 修订参数的后缀 ~<n> 表示指定提交对象的第 n 代祖先对象，跟随其第一个父对象。

source: A symbolic ref name.
zh_cn: 符号引用名称。

source: A trailing "/**" matches everything inside.
zh_cn: 尾随的 "/**" 匹配内部所有内容。

source: A typical integrator’s Git day.
zh_cn: 一个典型的集成者的 Git 日常。

source: A web browser will be used for that purpose.
zh_cn: 网络浏览器将用于此目的。

source: Abort the rebase operation and reset HEAD to the original branch.
zh_cn: 中止 rebase 操作并将 HEAD 重置到原始分支。

source: Abort the rebase operation but HEAD is not reset back to the original branch.
zh_cn: 中止 rebase 操作，但 HEAD 不会重置回原始分支。

source: About
zh_cn: 关于

source: Add "glob" magic to all pathspec.
zh_cn: 将 "glob" 魔术添加到所有路径。

source: Add "icase" magic to all pathspec.
zh_cn: 添加 "icase" 魔术到所有路径规则。

source: Add "literal" magic to all pathspec.
zh_cn: 为所有路径规则添加 "字面的" 魔术。

source: Add Signed-off-by line by the committer at the end of the commit log message.
zh_cn: 在提交日志消息结束时由提交者添加签名。

source: Add a new remote, fetch, and check out a branch from it
zh_cn: 添加一个新的远程，抓取，并从中检出一个分支

source: Add a tag reference in refs/tags/, unless -d/-l/-v is given to delete, list or verify tags.
zh_cn: 在 refs/tags/ 中添加一个标签引用，除非给出了删除，列出或验证标签的 -d/-l/-v 。

source: Add all existing files to the index.
zh_cn: 将所有现有文件添加到索引。

source: Add file contents to the index
zh_cn: 将文件内容添加到索引

source: Add modified contents in the working tree interactively to the index.
zh_cn: 将工作树中的修改内容交互地添加到索引。

source: Add or inspect object notes
zh_cn: 添加或检查对象注释

source: Added content is represented by lines beginning with "+".
zh_cn: 添加的内容由以"+"开头的行表示。

source: Additionally, "[PATCH]" will be stripped from the commit description.
zh_cn: 另外， "[PATCH]" 将从提交描述中删除。

source: Adds a new line to the option without altering any existing values.
zh_cn: 在选项中添加新行，而不更改任何现有值。

source: Adds a remote named <name> for the repository at <url>.
zh_cn: 在 <url> 中的仓库添加名为 <name> 的远程。

source: Adds content from all *.txt files under Documentation directory and its subdirectories:
zh_cn: 从 Documentation 目录及其子目录中的所有 *.txt 文件中添加内容：

source: Administering
zh_cn: 管理

source: Administration
zh_cn: 管理

source: Advanced branch management
zh_cn: 高级分支管理
